src/InformationRegisters/НеОтправленныеПрикладныеОбъектыEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НеОтправленныеПрикладныеОбъектыEDI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеПредлагатьКОтправке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПрикладнойОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрикладнойОбъектEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиПоставщикаEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПоставщикаEDI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>РежимРаботыСЗаказамиКлиентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РежимыРаботыСЗаказамиКлиентаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбновленияВСервисе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Покупатель</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОрганизацияКонтрагентEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/СостоянияДокументовEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовEDI</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентБЭД</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредыдущийСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоследнееДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПроцессаЗаказаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СторонаВыполнившаяДействие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтороныУчастникиСервисаEDI</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УточнениеСостоянияПоДаннымСтороныУчастника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаУточнениеСостоянияПоДаннымСтороныУчастника</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаТекущегоСтатуса</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТекущейВерсии</Name>
					<Comment>Номер последней загруженной в прикладной объект версии документа в сервисе</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерАктуальнойВерсии</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПрикладногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшТипаДокументаИСтатуса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПользовательEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПлановаяДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрикладнойОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПрикладнойОбъектEDI</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПрикладногоОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСоответствияПрикладногоОбъектаДокументуEDI</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяОтправкаДокумента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХэшОтправленногоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУказанияНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУказанияНоменклатурыБЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованнаяВерсияПокупателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СогласованнаяВерсияПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяСопоставлениеНоменклатурыПередОтправкой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторВСервисе</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДокумента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДокументовEDI</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/РежимыРаботыСЗаказамиКлиентаEDI.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>РежимыРаботыСЗаказамиКлиентаEDI</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПриниматьЗаказы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриниматьВТерминахПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриниматьВТерминахПоставщикаИПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИспользуетсяСтарыйЭДО</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/НеОтправленныеПрикладныеОбъектыEDI/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(ПрикладнойОбъект)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Устанавливает признак того, что документ больше не стоит предлагать к отправке для массива документов.
// 
// Параметры:
// 	МассивПрикладныхОбъектов - Массив - массив документов
//
Процедура УстановитьПризнакНеПредлагатьКОтправкеДляМассива(МассивПрикладныхОбъектов) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если МассивПрикладныхОбъектов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ПрикладнойОбъект Из МассивПрикладныхОбъектов Цикл
		
		НачатьТранзакцию();
	
		Попытка
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.НеОтправленныеПрикладныеОбъектыEDI");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("ПрикладнойОбъект", ПрикладнойОбъект);
	
			Блокировка.Заблокировать();
			
			НаборЗаписей = РегистрыСведений.НеОтправленныеПрикладныеОбъектыEDI.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ПрикладнойОбъект.Установить(ПрикладнойОбъект);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() = 0 Тогда
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
			НаборЗаписей[0].НеПредлагатьКОтправке = Истина;
			НаборЗаписей.Записать();
				
			ЗафиксироватьТранзакцию();
			
		Исключение
			ОтменитьТранзакцию();
			
			ЗаписьЖурналаРегистрации(ОбновлениеДанныхEDI.СобытиеЖурналаРегистрации(),
				УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				
			ВызватьИсключение НСтр("ru = 'Не удалось изменить признак ""не предлагать к отправке"".'");
			
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры

// Определяет, требуется ли для документа запись в регистре и создает или удаляет ее.
// 
// Параметры:
// 	ДанныеДокумента - Структура - содержит:
//   * ПрикладнойОбъект      - ДокументСсылка - 
//   * Контрагент            - ОпределяемыйТип.КонтрагентEDI -
//   * Организация           - ОпределяемыйТип.ОрганизацияEDI -
//   * НеПредлагатьКОтправке - Булево - текущее значение признака в регистре.
//   * Согласован            - Булево - документ прошел внутреннее согласование.
//   * Проведен              - Булево - признак проведения документа.
//
Процедура ОтразитьНеобходимостьОтправкиПоДаннымДокумента(ДанныеДокумента) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ДанныеДокумента.Вставить("НеПредлагатьКОтправке", Ложь);
	
	ТребуетсяЗапись                       = Ложь;
	ЕстьЗапись                            = Ложь;
	УжеОтправлен                          = Ложь;
	ПоставщикПринимаетЗаказыОтКонтрагента = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НеОтправленныеПрикладныеОбъектыEDI.ПрикладнойОбъект      КАК ПрикладнойОбъект,
	|	НеОтправленныеПрикладныеОбъектыEDI.НеПредлагатьКОтправке КАК НеПредлагатьКОтправке
	|ИЗ
	|	РегистрСведений.НеОтправленныеПрикладныеОбъектыEDI КАК НеОтправленныеПрикладныеОбъектыEDI
	|ГДЕ
	|	НеОтправленныеПрикладныеОбъектыEDI.ПрикладнойОбъект = &ПрикладнойОбъект
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////1
	|ВЫБРАТЬ
	|	НастройкиПоставщикаEDI.РежимРаботыСЗаказамиКлиентов КАК РежимРаботыСЗаказамиКлиентов,
	|	""ПоПокупателю""                                    КАК ВариантРежима
	|ИЗ
	|	РегистрСведений.НастройкиПоставщикаEDI КАК НастройкиПоставщикаEDI
	|ГДЕ
	|	НастройкиПоставщикаEDI.Поставщик    = &Контрагент
	|	И НастройкиПоставщикаEDI.Покупатель = &Организация
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	НастройкиПоставщикаEDI.РежимРаботыСЗаказамиКлиентов,
	|	""ПоПоставщику""
	|ИЗ
	|	РегистрСведений.НастройкиПоставщикаEDI КАК НастройкиПоставщикаEDI
	|ГДЕ
	|	НастройкиПоставщикаEDI.Поставщик    = &Контрагент
	|	И НастройкиПоставщикаEDI.Покупатель В (&ПустыеЗначенияПокупатели)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////2
	|ВЫБРАТЬ
	|	СостоянияДокументовEDI.ИдентификаторВСервисе КАК ИдентификаторВСервисе
	|ИЗ
	|	РегистрСведений.СостоянияДокументовEDI КАК СостоянияДокументовEDI
	|ГДЕ
	|	СостоянияДокументовEDI.ПрикладнойОбъект = &ПрикладнойОбъект";
	
	Запрос.УстановитьПараметр("ПрикладнойОбъект",         ДанныеДокумента.ПрикладнойОбъект);
	Запрос.УстановитьПараметр("Контрагент",               ДанныеДокумента.Контрагент);
	Запрос.УстановитьПараметр("Организация",              ДанныеДокумента.Организация);
	Запрос.УстановитьПараметр("ПустыеЗначенияПокупатели", ДокументыEDI.МассивПустыхЗначенийПоОписаниюТипа(РегистрыСведений.НастройкиПоставщикаEDI.ТипыИзмерения("Покупатель")));
	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ВыборкаЕстьЗапись = РезультатЗапроса[0].Выбрать();
	
	Если ВыборкаЕстьЗапись.Следующий() Тогда
	
		ЕстьЗапись = Истина;
		ДанныеДокумента.НеПредлагатьКОтправке = ВыборкаЕстьЗапись.НеПредлагатьКОтправке;
	
	КонецЕсли;
	
	ПараметрыПриемаЗаказовПоставщикомОтПокупателя = РегистрыСведений.НастройкиПоставщикаEDI.ПараметрыПриемаЗаказовПоставщикомОтПокупателя();
	ВыборкаРежимПриемаЗаказов = РезультатЗапроса[1].Выбрать();
	
	Пока ВыборкаРежимПриемаЗаказов.Следующий() Цикл
		
		Если ВыборкаРежимПриемаЗаказов.ВариантРежима = "ПоПокупателю" Тогда
			
			ПараметрыПриемаЗаказовПоставщикомОтПокупателя.РежимПриемаЗаказовПоПокупателю = ВыборкаРежимПриемаЗаказов.РежимРаботыСЗаказамиКлиентов;
			
		ИначеЕсли ВыборкаРежимПриемаЗаказов.ВариантРежима = "ПоПоставщику" Тогда
			
			ПараметрыПриемаЗаказовПоставщикомОтПокупателя.РежимПриемаЗаказовОбщий        = ВыборкаРежимПриемаЗаказов.РежимРаботыСЗаказамиКлиентов;
			
		КонецЕсли;
		
	КонецЦикла;
	
	РежимПриемаЗаказов = РегистрыСведений.НастройкиПоставщикаEDI.РежимПриемаЗаказовПоставщикомОтПокупателя(ПараметрыПриемаЗаказовПоставщикомОтПокупателя);
	ПоставщикПринимаетЗаказыОтКонтрагента = (РежимПриемаЗаказов = Перечисления.РежимыРаботыСЗаказамиКлиентаEDI.ПриниматьВТерминахПоставщика
	                                         Или РежимПриемаЗаказов = Перечисления.РежимыРаботыСЗаказамиКлиентаEDI.ПриниматьВТерминахПоставщикаИПокупателя);
	
	ВыборкаУжеОтправлен = РезультатЗапроса[2].Выбрать();
	
	Если ВыборкаУжеОтправлен.Следующий() Тогда
	
		УжеОтправлен = Истина;
	
	КонецЕсли;
	
	ТребуетсяЗапись = ДанныеДокумента.Согласован
	                  И ДанныеДокумента.Проведен
	                  И ПоставщикПринимаетЗаказыОтКонтрагента
	                  И Не УжеОтправлен;
	
	Если ЕстьЗапись 
		И Не ТребуетсяЗапись Тогда
		
		УдалитьЗапись(ДанныеДокумента.ПрикладнойОбъект);
		
	ИначеЕсли ТребуетсяЗапись Тогда
		
		ПараметрыЗаписи = ПараметрыЗаписиВРегистр();
		ЗаполнитьЗначенияСвойств(ПараметрыЗаписи, ДанныеДокумента);
		ВыполнитьЗаписьВРегистр(ПараметрыЗаписи)
		
	КонецЕсли;
	
КонецПроцедуры

// Удаляет запись по прикладному объекту из регистра
// 
// Параметры:
// 	ПрикладнойОбъект - ОпределяемыйТип.ПрикладнойДокументОбъектEDI - документ, по которому требуется удалить запись
//
Процедура УдалитьЗапись(ПрикладнойОбъект) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрикладнойОбъект.Установить(ПрикладнойОбъект);
	НаборЗаписей.Записать();
	
КонецПроцедуры

// Выполняет запись в регистр
// 
// Параметры:
// 	ПараметрыЗаписи - Структура - содержит:
// * НеПредлагатьКОтправке - Булево - 
// * Менеджер - СправочникСсылка.Пользователи -
// * Номер - Строка -
// * Дата - Дата -
// * Сумма - Число -
// * Валюта - СправочникСсылка.Валюты -
// * Контрагент - ОпределяемыйТип.КонтрагентEDI -
// * Организация - ОпределяемыйТип.ОрганизацияEDI -
// * ПрикладнойОбъект - ОпределяемыйТип.ПрикладнойДокументОбъектEDI 
//
Процедура ВыполнитьЗаписьВРегистр(ПараметрыЗаписи) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	НаборЗаписей = РегистрыСведений.НеОтправленныеПрикладныеОбъектыEDI.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.ПрикладнойОбъект.Установить(ПараметрыЗаписи.ПрикладнойОбъект);
	Запись = НаборЗаписей.Добавить();
	ЗаполнитьЗначенияСвойств(Запись, ПараметрыЗаписи);
	НаборЗаписей.Записать()
	
КонецПроцедуры

// Конструктор параметров записи в регистр
// 
// Возвращаемое значение:
// 	Структура - Описание:
// * НеПредлагатьКОтправке - Булево - 
// * Менеджер - СправочникСсылка.Пользователи -
// * Номер - Строка -
// * Дата - Дата -
// * Сумма - Число -
// * Валюта - СправочникСсылка.Валюты -
// * Контрагент - ОпределяемыйТип.КонтрагентEDI -
// * Организация - ОпределяемыйТип.ОрганизацияEDI -
// * ПрикладнойОбъект - ОпределяемыйТип.ПрикладнойДокументОбъектEDI -
//
Функция ПараметрыЗаписиВРегистр() Экспорт
	
	ПараметрыЗаписи = Новый Структура;
	ПараметрыЗаписи.Вставить("ПрикладнойОбъект"     , Неопределено);
	ПараметрыЗаписи.Вставить("Организация"          , Неопределено);
	ПараметрыЗаписи.Вставить("Контрагент"           , Неопределено);
	ПараметрыЗаписи.Вставить("Валюта"               , Неопределено);
	ПараметрыЗаписи.Вставить("Сумма"                , Неопределено);
	ПараметрыЗаписи.Вставить("Дата"                 , Неопределено);
	ПараметрыЗаписи.Вставить("Номер"                , Неопределено);
	ПараметрыЗаписи.Вставить("Менеджер"             , Неопределено);
	ПараметрыЗаписи.Вставить("НеПредлагатьКОтправке", Ложь);
	
	Возврат ПараметрыЗаписи;
	
КонецФункции

#КонецОбласти

#КонецЕсли
